In [2]:
raw_data = {'first_name': ['Jason','Molly','Tina','Jake','Amy'],
           'last_name': ['Miller','Jacobson','Ali','Milner','Cooze'],
           'age':[42,52,36,24,73],
           'city':["San Francisco","Baltimore","Miami","Douglas","Boston"]}
df1 = pd.DataFrame(raw_data)
df1

   age           city first_name last_name
0   42  San Francisco      Jason    Miller
1   52      Baltimore      Molly  Jacobson
2   36          Miami       Tina       Ali
3   24        Douglas       Jake    Milner
4   73         Boston        Amy     Cooze

In [3]:
df2 = pd.DataFrame(raw_data, columns=['first_name','last_name','age','city'])
df2

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [5]:
pd.DataFrame(raw_data, columns=['age','city'])

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

In [7]:
df.age > 40

0     True
1     True
2    False
3    False
4     True
Name: age, dtype: bool